Вотерхаус_Бухгалтерия_30.Бюджет/src/Catalogs/бджСтатьиБюджетаДоходовИРасходов/бджСтатьиБюджетаДоходовИРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бджСтатьиБюджетаДоходовИРасходов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекстЗапросаПолученияФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАналитики</name>
    <type>
      <types>EnumRef.бджТипыАналитикиСтатейБюджетаДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Вотерхаус_Бухгалтерия_30.Бюджет/src/Enums/бджТипыАналитикиСтатейБюджетаДоходовИРасходов/бджТипыАналитикиСтатейБюджетаДоходовИРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бджТипыАналитикиСтатейБюджетаДоходовИРасходов</name>
  <enumValues>
    <name>НоменклатурнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>СтатьяЗатрат</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыИРасходы</name>
  </enumValues>
  <enumValues>
    <name>БезАналитики</name>
  </enumValues>
</mdclass:Enum>

Вотерхаус_Бухгалтерия_30.Бюджет/src/Catalogs/бджСтатьиБюджетаДоходовИРасходов/Forms/ListForm/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСтатьиПоУмолчанию(Команда)
	ЗаполнитьСтатьиПоУмолчаниюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтатьиПоУмолчаниюНаСервере()
	
	СоздатьСтатьюПродажи();
	СоздатьСтатьюВыручка();
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюПродажи()
	
	Идентификатор = "ПродажиКоличество";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;	
		СтатьяОбъект.Порядок 		= 10;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Наименование = "Продажи, шт.";		
	СтатьяОбъект.ТипАналитики = Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.НоменклатурнаяГруппа;
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(ХозрасчетныйОборотыДтКт.Период, МЕСЯЦ) КАК Месяц,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК Аналитика,
	|	ХозрасчетныйОборотыДтКт.КоличествоОборотКт КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &КонецПериода, Месяц,,,
	|		СчетКт.КодБыстрогоВыбора = ""90011"",,) КАК ХозрасчетныйОборотыДтКт";
	СтатьяОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатьюВыручка()
	
	Идентификатор = "Выручка";
	Статья = Справочники.бджСтатьиБюджетаДоходовИРасходов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если Не ЗначениеЗаполнено(Статья) Тогда
		СтатьяОбъект = Справочники.бджСтатьиБюджетаДоходовИРасходов.СоздатьЭлемент();
		СтатьяОбъект.Идентификатор 	= Идентификатор;	
		СтатьяОбъект.Использовать 	= Истина;	
		СтатьяОбъект.Порядок 		= 20;
	Иначе
		СтатьяОбъект = Статья.ПолучитьОбъект();
	КонецЕсли;	
	СтатьяОбъект.Наименование = "Выручка, руб.";		
	СтатьяОбъект.ТипАналитики = Перечисления.бджТипыАналитикиСтатейБюджетаДоходовИРасходов.НоменклатурнаяГруппа;
	СтатьяОбъект.ТекстЗапросаПолученияФакта =
	"ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(ХозрасчетныйОборотыДтКт.Период, МЕСЯЦ) КАК Месяц,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК Аналитика,
	|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК ЗначениеФакт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &КонецПериода, Месяц,,,
	|		СчетКт.КодБыстрогоВыбора = ""90011"",,) КАК ХозрасчетныйОборотыДтКт";
	СтатьяОбъект.Записать();

КонецПроцедуры

#КонецОбласти
